<template>
  <div class="evaluate">
    <div class="rate">
      <ul>
        <li v-for="(item,index) in learn.evaluate" @click="evaluatedetail(index)">
          <span>{{item.teacher}}</span>
          <span>{{item.class}}</span>
        </li>
      </ul>
    </div>
  </div>
</template>

<script type="text/ecmascript-6">
  export default {
    data(){
      return {
        learn: {
          'evaluate': [
            {
              'teacher': '张老师',
              'class': '共产党宣言',
              'pic': 'http://static.galileo.xiaojukeji.com/static/tms/default_header.png',
              'single1': [
                {
                  'sgproblem': '1.你认为老师是否关心学生',
                  'A': '是',
                  'B': '一般',
                  'C': '否'
                },
                {
                  'sgproblem': '2.你认为老师对所教科目进行辅导和温习的情况如何？',
                  'A': '很熟悉',
                  'B': '一般',
                  'C': '不熟悉'
                },
                {
                  'sgproblem': '3.是否讲脏话，打骂学生。',
                  'A': '没有',
                  'B': ' 生气发火时有',
                  'C': '经常'
                },
                {
                  'sgproblem': '4.你对老师布置的作业及批改情况满意么',
                  'A': '很满意',
                  'B': '一般',
                  'C': '不满意'
                },
                {
                  'sgproblem': '5.该老师的课堂教学以什么为主',
                  'A': '课程组织合理，适合本人学习',
                  'B': '教案简单，针对性不强',
                  'C': '照本宣科'
                },
                {
                  'sgproblem': '6.该教师上课有无不良现象，如吸烟，接打手机，迟到早退等。',
                  'A': '很少',
                  'B': '一般',
                  'C': '经常'
                },
                {
                  'sgproblem': '7.是否模范遵守师德规范，是否处处为人师表。',
                  'A': '是',
                  'B': '一般',
                  'C': '不'
                },
                {
                  'sgproblem': '8.老师对学习较差的学生。',
                  'A': '和其他同学一样一视同仁',
                  'B': '有点歧视',
                  'C': '放任不管'
                },
                {
                  'sgproblem': '9.你认为该教师的责任心。',
                  'A': '责任心非常强',
                  'B': '责任心一般',
                  'C': '没有责任心'
                },
                {
                  'sgproblem': '10.仪表形象是否符合教师的要求。',
                  'A': '符合',
                  'B': '一般',
                  'C': '不符合'
                }
              ],
              'single2': [
                {
                  'sgproblem': '1.该老师上课后，对刚学的知识是否及时布置作业巩固知识。',
                  'A': '经常布置作业',
                  'B': '很少布置作业',
                  'C': '几乎不布置作业'
                },
                {
                  'sgproblem': '2.该老师的课堂教学以什么为主',
                  'A': '课程组织合理，适合本人学习',
                  'B': '教案简单，针对性不强',
                  'C': '照本宣科'
                },
                {
                  'sgproblem': '3.教师对成绩不一样的学生评价语言都是一样的吗。',
                  'A': '一样',
                  'B': '偶尔一样',
                  'C': '不一样'
                },
                {
                  'sgproblem': '4.教学模式。',
                  'A': '经常提出问题，组织学生讨论',
                  'B': '偶尔提出问题，提问个别学生',
                  'C': '基本上不提问题，一讲到底'
                },
                {
                  'sgproblem': '5.学法指导方面。',
                  'A': '能组织学生共同探索解题途径，重视总结解题方法',
                  'B': '很少组织同学分析解题思路，经常给同学总结解题方法',
                  'C': '不重视解题方法的总结'
                },
                {
                  'sgproblem': '6.该教师上课能用教具、课件和现代信息技术进行教学吗。',
                  'A': '基本上课都用教具、课件和现代信息技术进行教学',
                  'B': '有时用',
                  'C': '从来不用'
                },
                {
                  'sgproblem': '7.该教师上课是否用普通话。',
                  'A': '很标准',
                  'B': '还行',
                  'C': '口音太重'
                },
                {
                  'sgproblem': '8.老师是否在每次上课前认真备课并有针对性？',
                  'A': '有',
                  'B': '一般',
                  'C': '没有'
                },
                {
                  'sgproblem': '9.该老师是否热爱学习，博学多才？',
                  'A': '是的',
                  'B': '专业知识强，不善于表达',
                  'C': '经常问题目不会'
                },
                {
                  'sgproblem': '10.老师能鼓励你去发现和提出问题，能以你的回答为出发点开展教学吗？',
                  'A': '经常',
                  'B': '有时',
                  'C': '没有'
                }
              ],
              'single3': [
                {
                  'sgproblem': '1.你对该教师的课堂教学感兴趣吗？',
                  'A': '很感谢兴趣',
                  'B': '一般',
                  'C': '不感兴趣'
                },
                {
                  'sgproblem': '2.对老师所教的这门课你喜欢吗？',
                  'A': '喜欢',
                  'B': '一般',
                  'C': '不喜欢'
                },
                {
                  'sgproblem': '3.提问及互动环节',
                  'A': '经常',
                  'B': '一般',
                  'C': '没有'
                },
                {
                  'sgproblem': '4.该教师的课程是否丰富且很有吸引力？',
                  'A': '很丰富',
                  'B': '一般',
                  'C': '乏味'
                },
                {
                  'sgproblem': '5.您认为课堂上的学习气氛如何。',
                  'A': '很活跃',
                  'B': '总体一般',
                  'C': '气氛比较沉闷'
                },
                {
                  'sgproblem': '6.您认为任课老师课堂的授课效果如何。',
                  'A': '很好',
                  'B': ' 一般',
                  'C': '很差'
                },
                {
                  'sgproblem': '7.您是否愿意再次上此老师的课。',
                  'A': '可以',
                  'B': '一般',
                  'C': '不想'
                },
                {
                  'sgproblem': '8.该老师的是否擅长化解沉闷消极的气氛？',
                  'A': '擅长',
                  'B': '一般',
                  'C': '不会'
                },
                {
                  'sgproblem': '9.该老师的性格？',
                  'A': '乐观精力旺盛',
                  'B': '一般',
                  'C': '内向消极'
                },
                {
                  'sgproblem': '10.老师的教学是否具有启发性？',
                  'A': '让我思考深入',
                  'B': '一般',
                  'C': '让我怀疑人生'
                }
              ]
            },
            {
              'teacher': '陈老师',
              'class': '毛泽东语录',
              'pic': 'http://static.galileo.xiaojukeji.com/static/tms/default_header.png',
              'single1': [
                {
                  'sgproblem': '1.你认为老师是否关心学生',
                  'A': '是',
                  'B': '一般',
                  'C': '否'
                },
                {
                  'sgproblem': '2.你认为老师对所教科目进行辅导和温习的情况如何？',
                  'A': '很熟悉',
                  'B': '一般',
                  'C': '不熟悉'
                },
                {
                  'sgproblem': '3.是否讲脏话，打骂学生。',
                  'A': '没有',
                  'B': ' 生气发火时有',
                  'C': '经常'
                },
                {
                  'sgproblem': '4.你对老师布置的作业及批改情况满意么',
                  'A': '很满意',
                  'B': '一般',
                  'C': '不满意'
                },
                {
                  'sgproblem': '5.该老师的课堂教学以什么为主',
                  'A': '课程组织合理，适合本人学习',
                  'B': '教案简单，针对性不强',
                  'C': '照本宣科'
                },
                {
                  'sgproblem': '6.该教师上课有无不良现象，如吸烟，接打手机，迟到早退等。',
                  'A': '很少',
                  'B': '一般',
                  'C': '经常'
                },
                {
                  'sgproblem': '7.是否模范遵守师德规范，是否处处为人师表。',
                  'A': '是',
                  'B': '一般',
                  'C': '不'
                },
                {
                  'sgproblem': '8.老师对学习较差的学生。',
                  'A': '和其他同学一样一视同仁',
                  'B': '有点歧视',
                  'C': '放任不管'
                },
                {
                  'sgproblem': '9.你认为该教师的责任心。',
                  'A': '责任心非常强',
                  'B': '责任心一般',
                  'C': '没有责任心'
                },
                {
                  'sgproblem': '10.仪表形象是否符合教师的要求。',
                  'A': '符合',
                  'B': '一般',
                  'C': '不符合'
                }
              ],
              'single2': [
                {
                  'sgproblem': '1.该老师上课后，对刚学的知识是否及时布置作业巩固知识。',
                  'A': '经常布置作业',
                  'B': '很少布置作业',
                  'C': '几乎不布置作业'
                },
                {
                  'sgproblem': '2.该老师的课堂教学以什么为主',
                  'A': '课程组织合理，适合本人学习',
                  'B': '教案简单，针对性不强',
                  'C': '照本宣科'
                },
                {
                  'sgproblem': '3.教师对成绩不一样的学生评价语言都是一样的吗。',
                  'A': '一样',
                  'B': '偶尔一样',
                  'C': '不一样'
                },
                {
                  'sgproblem': '4.教学模式。',
                  'A': '经常提出问题，组织学生讨论',
                  'B': '偶尔提出问题，提问个别学生',
                  'C': '基本上不提问题，一讲到底'
                },
                {
                  'sgproblem': '5.学法指导方面。',
                  'A': '能组织学生共同探索解题途径，重视总结解题方法',
                  'B': '很少组织同学分析解题思路，经常给同学总结解题方法',
                  'C': '不重视解题方法的总结'
                },
                {
                  'sgproblem': '6.该教师上课能用教具、课件和现代信息技术进行教学吗。',
                  'A': '基本上课都用教具、课件和现代信息技术进行教学',
                  'B': '有时用',
                  'C': '从来不用'
                },
                {
                  'sgproblem': '7.该教师上课是否用普通话。',
                  'A': '很标准',
                  'B': '还行',
                  'C': '口音太重'
                },
                {
                  'sgproblem': '8.老师是否在每次上课前认真备课并有针对性？',
                  'A': '有',
                  'B': '一般',
                  'C': '没有'
                },
                {
                  'sgproblem': '9.该老师是否热爱学习，博学多才？',
                  'A': '是的',
                  'B': '专业知识强，不善于表达',
                  'C': '经常问题目不会'
                },
                {
                  'sgproblem': '10.老师能鼓励你去发现和提出问题，能以你的回答为出发点开展教学吗？',
                  'A': '经常',
                  'B': '有时',
                  'C': '没有'
                }
              ],
              'single3': [
                {
                  'sgproblem': '1.你对该教师的课堂教学感兴趣吗？',
                  'A': '很感谢兴趣',
                  'B': '一般',
                  'C': '不感兴趣'
                },
                {
                  'sgproblem': '2.对老师所教的这门课你喜欢吗？',
                  'A': '喜欢',
                  'B': '一般',
                  'C': '不喜欢'
                },
                {
                  'sgproblem': '3.提问及互动环节',
                  'A': '经常',
                  'B': '一般',
                  'C': '没有'
                },
                {
                  'sgproblem': '4.该教师的课程是否丰富且很有吸引力？',
                  'A': '很丰富',
                  'B': '一般',
                  'C': '乏味'
                },
                {
                  'sgproblem': '5.您认为课堂上的学习气氛如何。',
                  'A': '很活跃',
                  'B': '总体一般',
                  'C': '气氛比较沉闷'
                },
                {
                  'sgproblem': '6.您认为任课老师课堂的授课效果如何。',
                  'A': '很好',
                  'B': ' 一般',
                  'C': '很差'
                },
                {
                  'sgproblem': '7.您是否愿意再次上此老师的课。',
                  'A': '可以',
                  'B': '一般',
                  'C': '不想'
                },
                {
                  'sgproblem': '8.该老师的是否擅长化解沉闷消极的气氛？',
                  'A': '擅长',
                  'B': '一般',
                  'C': '不会'
                },
                {
                  'sgproblem': '9.该老师的性格？',
                  'A': '乐观精力旺盛',
                  'B': '一般',
                  'C': '内向消极'
                },
                {
                  'sgproblem': '10.老师的教学是否具有启发性？',
                  'A': '让我思考深入',
                  'B': '一般',
                  'C': '让我怀疑人生'
                }
              ]
            },
            {
              'teacher': '张老师',
              'class': '马克思主义哲学',
              'pic': 'http://static.galileo.xiaojukeji.com/static/tms/default_header.png',
              'single1': [
                {
                  'sgproblem': '1.你认为老师是否关心学生',
                  'A': '是',
                  'B': '一般',
                  'C': '否'
                },
                {
                  'sgproblem': '2.你认为老师对所教科目进行辅导和温习的情况如何？',
                  'A': '很熟悉',
                  'B': '一般',
                  'C': '不熟悉'
                },
                {
                  'sgproblem': '3.是否讲脏话，打骂学生。',
                  'A': '没有',
                  'B': ' 生气发火时有',
                  'C': '经常'
                },
                {
                  'sgproblem': '4.你对老师布置的作业及批改情况满意么',
                  'A': '很满意',
                  'B': '一般',
                  'C': '不满意'
                },
                {
                  'sgproblem': '5.该老师的课堂教学以什么为主',
                  'A': '课程组织合理，适合本人学习',
                  'B': '教案简单，针对性不强',
                  'C': '照本宣科'
                },
                {
                  'sgproblem': '6.该教师上课有无不良现象，如吸烟，接打手机，迟到早退等。',
                  'A': '很少',
                  'B': '一般',
                  'C': '经常'
                },
                {
                  'sgproblem': '7.是否模范遵守师德规范，是否处处为人师表。',
                  'A': '是',
                  'B': '一般',
                  'C': '不'
                },
                {
                  'sgproblem': '8.老师对学习较差的学生。',
                  'A': '和其他同学一样一视同仁',
                  'B': '有点歧视',
                  'C': '放任不管'
                },
                {
                  'sgproblem': '9.你认为该教师的责任心。',
                  'A': '责任心非常强',
                  'B': '责任心一般',
                  'C': '没有责任心'
                },
                {
                  'sgproblem': '10.仪表形象是否符合教师的要求。',
                  'A': '符合',
                  'B': '一般',
                  'C': '不符合'
                }
              ],
              'single2': [
                {
                  'sgproblem': '1.该老师上课后，对刚学的知识是否及时布置作业巩固知识。',
                  'A': '经常布置作业',
                  'B': '很少布置作业',
                  'C': '几乎不布置作业'
                },
                {
                  'sgproblem': '2.该老师的课堂教学以什么为主',
                  'A': '课程组织合理，适合本人学习',
                  'B': '教案简单，针对性不强',
                  'C': '照本宣科'
                },
                {
                  'sgproblem': '3.教师对成绩不一样的学生评价语言都是一样的吗。',
                  'A': '一样',
                  'B': '偶尔一样',
                  'C': '不一样'
                },
                {
                  'sgproblem': '4.教学模式。',
                  'A': '经常提出问题，组织学生讨论',
                  'B': '偶尔提出问题，提问个别学生',
                  'C': '基本上不提问题，一讲到底'
                },
                {
                  'sgproblem': '5.学法指导方面。',
                  'A': '能组织学生共同探索解题途径，重视总结解题方法',
                  'B': '很少组织同学分析解题思路，经常给同学总结解题方法',
                  'C': '不重视解题方法的总结'
                },
                {
                  'sgproblem': '6.该教师上课能用教具、课件和现代信息技术进行教学吗。',
                  'A': '基本上课都用教具、课件和现代信息技术进行教学',
                  'B': '有时用',
                  'C': '从来不用'
                },
                {
                  'sgproblem': '7.该教师上课是否用普通话。',
                  'A': '很标准',
                  'B': '还行',
                  'C': '口音太重'
                },
                {
                  'sgproblem': '8.老师是否在每次上课前认真备课并有针对性？',
                  'A': '有',
                  'B': '一般',
                  'C': '没有'
                },
                {
                  'sgproblem': '9.该老师是否热爱学习，博学多才？',
                  'A': '是的',
                  'B': '专业知识强，不善于表达',
                  'C': '经常问题目不会'
                },
                {
                  'sgproblem': '10.老师能鼓励你去发现和提出问题，能以你的回答为出发点开展教学吗？',
                  'A': '经常',
                  'B': '有时',
                  'C': '没有'
                }
              ],
              'single3': [
                {
                  'sgproblem': '1.你对该教师的课堂教学感兴趣吗？',
                  'A': '很感谢兴趣',
                  'B': '一般',
                  'C': '不感兴趣'
                },
                {
                  'sgproblem': '2.对老师所教的这门课你喜欢吗？',
                  'A': '喜欢',
                  'B': '一般',
                  'C': '不喜欢'
                },
                {
                  'sgproblem': '3.提问及互动环节',
                  'A': '经常',
                  'B': '一般',
                  'C': '没有'
                },
                {
                  'sgproblem': '4.该教师的课程是否丰富且很有吸引力？',
                  'A': '很丰富',
                  'B': '一般',
                  'C': '乏味'
                },
                {
                  'sgproblem': '5.您认为课堂上的学习气氛如何。',
                  'A': '很活跃',
                  'B': '总体一般',
                  'C': '气氛比较沉闷'
                },
                {
                  'sgproblem': '6.您认为任课老师课堂的授课效果如何。',
                  'A': '很好',
                  'B': ' 一般',
                  'C': '很差'
                },
                {
                  'sgproblem': '7.您是否愿意再次上此老师的课。',
                  'A': '可以',
                  'B': '一般',
                  'C': '不想'
                },
                {
                  'sgproblem': '8.该老师的是否擅长化解沉闷消极的气氛？',
                  'A': '擅长',
                  'B': '一般',
                  'C': '不会'
                },
                {
                  'sgproblem': '9.该老师的性格？',
                  'A': '乐观精力旺盛',
                  'B': '一般',
                  'C': '内向消极'
                },
                {
                  'sgproblem': '10.老师的教学是否具有启发性？',
                  'A': '让我思考深入',
                  'B': '一般',
                  'C': '让我怀疑人生'
                }
              ]
            }
          ]
        }
      }
    },
    created(){
      document.body.style.backgroundColor = 'rgba(7,17,27,0.1)'
    },
    methods: {
      evaluatedetail(index){
        this.$router.push({
          path: '/learn/evaluate/evadetail',
          query: {index: index}
        })
      }
    }
  }
</script>

<style lang="stylus" type="text/stylus">
  .evaluate
    height 100%
    overflow hidden
    .rate
      height 100%
      position relative
      top -50px
      overflow hidden
      ul
        padding-top 80px
        li
          margin 0 auto 20px
          width 80%
          height 42px
          background white
          box-shadow: 2px 2px 4px rgba(7, 17, 27, 0.4)
          line-height 42px
          border-radius 5px
          span
            display inline-block
            &:first-child
              width 30%
              padding-left 30px
</style>
